# -*- coding: utf-8  -*-
# -*- author: jokker -*-

# TODO: 和数据库进行交互，

# --------------------------------------- 对外的接口 --------------------------------------------------------------------
# * get_uc, md5_set, md5_uc_dict

# * has_md5(md5_str), 查询某个 md5 是否已经被注册

# * has_img(uc), 查看某个 uc 下面是否有对应的图片，没有图片得推送图片

# * push_img_to_database, 图片的二进制，图片的 xml 信息 json 存储, 图片的 uc（不能为空，服务端不提供计算 uc 的功能）

# ----------------------------------------------------------------------------------------------------------------------

# 写数据库的时候，数据库锁定，

# 最好能





